{
  "profile": {
    "name": "Jimmy Yan",
    "job": "Full-stack Web Engineer, Revit Development Engineer, Tech Enthusiast, Xiaomi Fan",
    "avatar": "img/profile/me.jpg",
    "aboutMe": "I am a full-stack developer with a civil engineering background and experience in C# Revit plugin development. Now focused on web development, I work with Vue.js, NestJS, Prisma, and MySQL. I'm skilled in problem-solving, teamwork, and quick adaptation. Ready to contribute and grow in web development.",
    "socialNetwork": [
      {
        "name": "Github",
        "url": "https://github.com/MilletQ"
      },
      {
        "name": "Weibo",
        "url": "https://m.weibo.cn/u/3846297987"
      },
      {
        "name": "bilibili",
        "url": "https://space.bilibili.com/9673347/"
      }
    ]
  },
  "cv": {
    "icon": "DocumentTextIcon",
    "name": "Download PDF Resume",
    "value": "Jimmy Yan - Resume"
  },
  "information": [
    {
      "icon": "HomeIcon",
      "name": "Hometown",
      "value": "Zhangzhou, Fujian, China"
    },
    {
      "icon": "CakeIcon",
      "name": "Date of Birth",
      "value": "October 1993"
    },
    {
      "icon": "ComputerDesktopIcon",
      "name": "Work Preference",
      "value": "Full-time, Remote Work"
    },
    {
      "icon": "DevicePhoneMobileIcon",
      "name": "Contact",
      "value": "(+86)15505922750"
    },
    {
      "icon": "EnvelopeIcon",
      "name": "Email",
      "value": "wiseglint@foxmail.com"
    }
  ],
  "skill": [
    "Vue3",
    "TypeScript",
    "Pinia",
    "VueRouter",
    "Sass",
    "JavaScript",
    "HTML",
    "CSS",
    "Tailwindcss",
    "ElementPlus",
    "NodeJS",
    "NestJs",
    "Prisma",
    "MySql",
    "Redis",
    "Prettier",
    "ESLint",
    "C#",
    "WPF",
    "RevitAPI",
    "Git"
  ],
  "experience": [
    {
      "job": "R&D Engineer",
      "company": "Fujian Zuohai Technology Co., Ltd.",
      "companyLogo": "img/company/zit.jpg",
      "location": "Fuzhou",
      "workType": "Full-time",
      "start": "Nov 2020",
      "end": "Now",
      "description": "At Fujian Zuohai Technology Co., Ltd., I serve as an R&D Engineer. My main responsibilities include secondary plugin development on platforms like Revit, CAD, and Tekla, automating architectural model processing and exporting model data. I am also responsible for developing web management platforms and integrating model data, developing both the front and back ends of MES and CRM platforms, visualizing and managing model data. The main technology stack includes Vue.js, Nest.js, Redis, and MySQL."
    },
    {
      "job": "Construction Supervisor, Technician",
      "company": "China State Construction Engineering Corporation",
      "companyLogo": "img/company/cscec.jpg",
      "location": "Fuzhou",
      "workType": "Full-time",
      "start": "Oct 2019",
      "end": "Nov 2020",
      "description": "At the China State Construction Fourth Engineering Bureau Fuzhou Vanke Lanyue Garden project, I served as a Technician in the Engineering Management Department and as an on-site Construction Supervisor. My main tasks involved compiling construction plans, CAD drafting, BIM model creation, and managing on-site construction."
    },
    {
      "job": "Construction Supervisor, Technician",
      "company": "Power Construction Corporation of China",
      "companyLogo": "img/company/powerchina.jpg",
      "location": "Shenzhen",
      "workType": "Full-time",
      "start": "Jul 2017",
      "end": "Oct 2019",
      "description": "At the China Hydropower Seventh Engineering Bureau's Qianhai Sanxiao Project in Shenzhen and the North Line Water Diversion Project Safety Hazard Rectification Project in Shenzhen, I worked as a Technician in the Engineering Management Department and an on-site Construction Supervisor. My main responsibilities included scheduling construction plans in Project, compiling construction plans, company report materials, engineering quantity calculation, engineering measurement, design change compilation, on-site technical briefings, CAD drafting, and coordinating external land acquisitions."
    }
  ],
  "education": [
    {
      "college": "Huaqiao University",
      "collegeLogo": "img/college/huaqiao.jpg",
      "course": "Civil Engineering",
      "start": "2013",
      "end": "2017"
    }
  ],
  "project": [
    {
      "name": "MES Intelligent Manufacturing Platform",
      "description": "A Platform supports the entire process of component production, warehousing, logistics, and installation, serving component manufacturing companies. It provides digital solutions for stages such as project material requests, production preparation, production process, component storage, logistics transportation, and on-site installation.",
      "language": "Vue3, NodeJS, MySQL, Redis",
      "image": "img/project/mes.png"
    },
    {
      "name": "CRM Customer Marketing Platform",
      "description": "The Platform is a comprehensive software solution aimed at helping businesses build, maintain, and enhance relationships with customers.",
      "language": "Vue3, NodeJS, MySQL, Redis",
      "image": "img/project/crm.png"
    },
    {
      "name": "Revit Aluminum Formwork Design System",
      "description": "The System is a specialized plugin developed on the Revit platform to streamline the aluminum formwork design process. It supports automated modeling, batch model adjustments, drawing editing, automated annotation, batch drawing export, BOM export, and data integration with external platforms.",
      "language": "C#, WPF, RevitAPI",
      "image": "img/project/revit.png"
    }
  ]
}
